/*********************************************************************************************************
* 模块名称: UART1.h
* 摘    要: 串口模块，包括串口模块初始化，以及中断服务函数处理，以及读写串口函数实现
* 当前版本: 1.0.0
* 作    者: SZLY(COPYRIGHT 2018 SZLY. All rights reserved.)
* 完成日期: 2018年01月01日 
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/
#ifndef _UART2_H_
#define _UART2_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include <stdio.h>
#include "stm32f10x_conf.h"
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define   UART_BUF_SIZE 100           //设置缓冲区的大小

#define   DEBUG_USARTx                  USART2
#define   DEBUG_USART_CLK               RCC_APB1Periph_USART2
#define   DEBUG_USART_APBxClkCmd        RCC_APB1PeriphClockCmd
#define   DEBUG_USART_BAUDRATE          9600

#define   DEBUG_USART_GPIO_CLK          RCC_APB2Periph_GPIOA
#define   DEBUG_USART_GPIO_APBxClkCmd   RCC_APB2PeriphClockCmd

#define   DEBUG_USART_TX_GPIO_PORT      GPIOA
#define   DEBUG_USART_TX_GPIO_PIN       GPIO_Pin_2
#define   DEBUG_USART_RX_GPIO_PORT      GPIOA
#define   DEBUG_USART_RX_GPIO_PIN       GPIO_Pin_3

#define   DEBUG_USART_IRQ               USART2_IRQn
#define   DEBUG_USART_IRQHandler        USART2_IRQHandler

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitUART2(u32 bound);          //初始化UART模块
u8    WriteUART2(u8 *pBuf, u8 len);  //写串口，返回已写入的字节数
u8    ReadUART2(u8 *pBuf, u8 len);   //读串口，返回读到的字节数

#endif
